Repository: bramapeters97/lelibrambas-tv
Catalog: apps/apple-tv/TVApp/Resources/Localizable.xcstrings
Source language: en
Languages: nl

source: 10 seconds back
nl: 10 seconden terug

source: 10 seconds forward
nl: 10 seconden vooruit

source: A film from the private family archive.
nl: Een film uit het privéfamiliearchief.

source: Back
nl: Terug

source: Cancel
nl: Annuleer

source: Check the internet connection and try again.
nl: Controleer de internetverbinding en probeer het opnieuw.

source: Collection not found
nl: Collectie niet gevonden

source: Collections
nl: Collecties

source: Every available film, ordered as in the web archive.
nl: Elke beschikbare film, in dezelfde volgorde als in het webarchief.

source: FEATURED FROM THE ARCHIVE
nl: UITGELICHT UIT HET ARCHIEF

source: Film not found
nl: Film niet gevonden

source: Library
nl: Bibliotheek

source: More info
nl: Meer informatie

source: No description is available for this film.
nl: Er is geen beschrijving beschikbaar voor deze film.

source: No films found
nl: Geen films gevonden

source: Opening the family archive…
nl: Het familiearchief wordt geopend…

source: Play
nl: Afspelen

source: Playback stopped
nl: Afspelen gestopt

source: Playback unavailable
nl: Afspelen niet beschikbaar

source: Preparing…
nl: Voorbereiden…

source: Retry
nl: Opnieuw proberen

source: Return to details
nl: Terug naar details

source: Search
nl: Zoeken

source: Settings
nl: Instellingen

source: The archive could not be loaded
nl: Het archief kon niet worden geladen

source: The archive is quiet
nl: Het archief is stil

source: The archive is resting
nl: Het archief rust even

source: This film is unavailable
nl: Deze film is niet beschikbaar

source: Try again
nl: Probeer opnieuw

source: Try another title or collection name.
nl: Probeer een andere titel of collectienaam.

source: Your private cinema, on the biggest screen.
nl: Je privébioscoop, op het grootste scherm.
